var dataSet = [
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    " <span>علي فارس</span>",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "مالي",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "قانوني",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],

  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "مالي",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "قانوني",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "مالي",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "قانوني",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    " <span>علي فارس</span>",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
  [
    1,
    "طلب تعويض من المدعى عليه نتيجة تعديه على بيتي الملف",
    "اداري",
    "علي فارس",
    "مدعي",
    "خالد علي",
    "مدعي عليه",
    "تفاصيل الطلب",
  ],
];

dataSet.forEach((d) => {
  d[2] = changecolor(d[2]);
     d[d.length - 1] = detailsreqa(d[d.length - 1]);
});
function detailsreqa(data) {
  return `<a htrf="./details.html"><u>${data}</u></a>`;
}
function changecolor(data) {
  if (data.trim() == "اداري") {
    return `<span class="bg-[#55618C1A] px-3 py-2 text-[#0d0c22cc]  rounded-full ">${data}</span>`;
  }
  if (data.trim() == "مالي") {
    return `<span class="bg-[#17CB131A] px-3 py-2 text-[#0d0c22cc]  rounded-full ">${data}</span>`;
  }
  if (data.trim() == "قانوني") {
    return `<span class="bg-[#E1A1231A] px-3 py-2 text-[#0d0c22cc]  rounded-full ">${data}</span>`;
  }
}
if(window.innerWidth<=900){
dataSet.forEach((d) => {
  d[1] = replace(d[1]);
});


function replace(data) {
  const str = data;
  const pattern = /^(\S+\s+\S+)/;
  const match = str.match(pattern);
  if (match) {
    const firstTwoWords = match[1] + " ...";
    return firstTwoWords;
  }
}   
}

